Repository: rankinc/sudoku-savant
Catalog: po/*.po
Languages: cs, de, fr

source: A sudoku solver/generator program, v
cs: Program pro vytváření a řešení Sudoku, v
de: Ein Sudoku-Erzeugungs- und Lösungsprogramm, v
fr: Un résolveur/générateur de soduku, v

source: Usage: sudoku-savant [options]
cs: Použití: sudoku-savant [volby]
de: Aufruf: sudoku-savant [Optionen]

source: Options:
cs: Volby:
de: Optionen:

source: -c, --code CODESTRING Load a 9x9 puzzle as a string of 81 digits
cs: -c, --code CODESTRING Nahrát hlavolam jako řetězec složený z 81 čísel
de: -c, --code ZEICHENKETTE Ein 9x9-Puzzle als Zeichenkette aus 81 Ziffern laden

source: -v, --version Show version information
cs: -v, --version Ukázat informace o verzi
de: -v, --version Versionsinformationen anzeigen

source: -h, --help Show this message
cs: -h, --help Ukázat tuto zprávu
de: -h, --help Diese Hilfemeldung anzeigen

source: Sudoku files may also be read from Standard Input.
cs: Soubory Sudoku mohou být čteny i z běžného vstupu.
de: Sudoku-Dateien können auch von der Standardeingabe gelesen werden.

source: Invalid option:
cs: Neplatná volba:
de: Ungültige Option:
fr: Option invalide

source: Exception:
cs: Výjimka:
de: Ausnahme:

source: Unknown exception
cs: Neznámá výjimka
de: Unbekannte Ausnahme
fr: Exception inconnue

source: Board size differs from input string
cs: Velikost hracího pole a zadaného řetězce znaků se liší
de: Spielfeldgröße und eingegebene Zeichenkette unterschiedlich
fr: La taille du tableu diffère de la chaîne d'entrée

source: Invalid option [
cs: Neplatná volba: [
de: Ungültige Option [
fr: Option invalide [

source: Impossible to solve for
cs: Řešení není možné pro
de: Lösung unmöglich für
fr: Impossible de résoudre

source: Unique logical solution
cs: Jedinečné logické řešení
de: Eine logische Lösung
fr: Qu'une solution logique

source: Unique solution (with some guesswork)
cs: Jedinečné logické řešení (s nějakým tím hádáním)
de: Eine logische Lösung (vermutlich)
fr: Solution unique (avec du travail devinés)

source: At least
cs: Alespoň
de: Mindestens
fr: Au moins

source: solutions
cs: řešení
de: Lösungen

source: Cannot complete the puzzle from this position.
cs: Doplnění hlavolamu z tohoto místa není možné.
de: Vervollständigung aus dieser Stellung nicht möglich.
fr: Ne peut compléter le jeu à ce stade.

source: : NO SOLUTION
cs: : ŽÁDNÉ ŘEŠENÍ
de: : KEINE LÖSUNG
fr: : PAS DE SOLUTION

source: Easy
cs: Jednoduchý
de: Leicht
fr: Facile

source: Moderate
cs: Střední
de: Mittel
fr: Modéré

source: Difficult
cs: Obtížný
de: Schwierig
fr: Difficile

source: Stinker
cs: Těžký
fr: Très difficile

source: Nightmare
cs: Zlý sen
de: Albtraum
fr: Expert

source: Obscene
cs: Do nebe volající
de: Obszön
fr: Obscènes

source: Box(
cs: boxu (
fr: Boîte{

source: Row
cs: řádku
de: Zeile
fr: Ligne

source: Column
cs: sloupci
de: Spalte
fr: Colonne

source: Cannot assign board with geometry
cs: Vytvoření hracího pole s tímto uspořádáním není možné
de: Erzeugung eines Spielfeldes mit dieser Geometrie nicht möglich
fr: Ne peut assingée cette géométrie au tableau

source: to one with geometry
cs: k hracímu poli s uspořádáním
de: zu Spielfeld mit Geometrie
fr: vers le premier avec géométrie

source: Unknown
cs: Neznámý
de: Unbekannt
fr: Inconnu

source: Select _Strategies
cs: Vybrat _strategie
de: _Strategie auswählen
fr: Séléctionner une _Stratégie

source: Minimum _Rating
cs: Stupeň _obtížnosti
de: Schwie_rigkeitsgrad
fr: _Niveau Minimum

source: _Reset Puzzle
cs: Nastavit hru _znovu
de: Spiel zu_rücksetzen
fr: _Réinitialiser le Puzzle

source: Undo
cs: Zpět
de: Rückgängig
fr: Défaire

source: Hint
cs: Rada
de: Hinweis
fr: Indice

source: Highlight cells marked with the chosen number
cs: Zvýraznit buňky označené vybraným číslem
de: Alle Zellen mit gewählter Zahl hervorheben.

source: Could not read file
cs: Soubor se nepodařilo přečíst
de: Datei konnte nicht gelesen werden
fr: Ne peut lire le fichier

source: Illegal puzzle
cs: Hrací pole odporující pravidlům
de: Regelwidriges Spielfeld
fr: Puzzle illégal

source: Invalid file format
cs: Neplatný souborový formát
de: Ungültiges Dateiformat
fr: Format de fichier invalide

source: Could not write to file
cs: Soubor se nepodařilo zapsat
de: Datei kann nicht geschrieben werden
fr: Ne peut écrire dans le fichier

source: _Done
cs: _Hotovo
de: _Fertig
fr: _Fait

source: _Manual
cs: _Vlastnoručně
de: _Manuell
fr: _Manuel

source: Number
cs: Číslo
de: Zahl
fr: Nombre

source: already present in
cs: je již v
de: ist bereits in
fr: déjà présent

source: Completed
cs: Dokončeno
de: Beendet
fr: Complété

source: A GUI version of a perfectly-good command line tool, written for the Linux Format magazine's "Sudoku Bounty" competition, and released under the GPL. With many thanks to the GTK and Glade developers, without whose efforts I would never have managed to get any kind of dratted GUI-thing working. Also, a big thank-you to the denizens of the "Advanced Solving Techniques" forum on www.sudoku.com, without whom I would never have understood half of the algorithms that I have implemented here.
cs: Obrazová verze dokonalého programu pro příkazový řádek, napsaná pro soutěž "Sudoku Bounty" v časopise "Linux Format", zveřejněná za podmínek GPL. Srdečné díky vývojářům GTK a Glade bez jejichž úsilí by se mi nikdy nepodařilo dostat jakékoli obrazové rozhraní do stavu, kdy by pracovalo. Velké poděkování patří také členům fóra "Advanced Solving Techniques"-na stránkách www.sudoku.com, bez nichž bych neporozuměl ani polovině algoritmů, jež jsou nyní základem programu.
de: Eine grafische Version eines perfekten Befehlszeilenprogramms, geschrieben für »Sudoku Bounty« in der Zeitschrift »Linux Format«, veröffentlicht unter den Bedingungen der GPL. Herzlichen Dank an die Entwickler von GTK und Glade, ohne deren Bemühungen ich wohl keine funktionierende grafische Anwendung zustande bekommen hätte. Vielen Dank auch an die Mitglieder des »Advanced Solving Techniques«-Forums auf www.sudoku.com, ohne die ich nicht einmal die Hälfte der Algorithmen verstanden hätte, die nun diesem Programm zugrunde liegen.

source: Forced to set
cs: Vynuceno nastavení
de: Setze
fr: Forcé de mettre en

source: to
cs: na
de: auf
fr: à

source: Proposing setting
cs: Návrh
de: Vorschlag
fr: Proposition de réglage

source: can only go in
cs: může být jen v
de: kann nur in
fr: peut seulement aller dans

source: in
cs: v
fr: dans

source: Numbers
cs: Čísla
de: Zahlen
fr: Nombres

source: must go in {
cs: musí být v {
de: muss in {
fr: doit aller dans {

source: } in
cs: } v
fr: } dans

source: } cannot be
cs: } nemůže být
de: } kann nicht
fr: } ne peut être

source: because
cs: protože
de: sein, weil
fr: parceque

source: is locked into
cs: je uzamčeno v
de: gesperrt ist in
fr: est bloqué dans

source: X-Wing
cs: X-křídlo
de: X-Schwinge

source: Swordfish
cs: Mečoun
de: Schwertfisch
fr: Espadon

source: Jellyfish
cs: Medúza
de: Qualle
fr: Méduses

source: Starfish
cs: Hvězdice
de: Seestern
fr: Poisson étoile

source: fish
cs: ryba
de: Fisch
fr: poisson

source: : Number
cs: : Číslo
de: : Zahl
fr: : Nombre

source: limited to positions
cs: je omezeno na
de: ist begrenzt auf
fr: limité à la position

source: in {
cs: v {
fr: dans {

source: XY-Wing at
cs: XY-křídla na
de: XY-Schwinge auf
fr: XY-Wing à

source: , branching to
cs: , se větví do
de: , verzweigt zu
fr: , branchement à

source: and
cs: a
de: und
fr: et

source: XYZ-Wing at
cs: XYZ-Křídla na
de: XYZ-Schwinge auf
fr: XYZ-Wing à

source: Multi-Colouring: {
cs: Více barev: {
de: Mehrere Farben: {
fr: Coloration multiple: {

source: Simple Colouring(
cs: Jednoduché barvy (
de: Einfache Farbe(
fr: Coloration simple(

source: Contradiction
cs: Rozpor
de: Widerspruch

source: Exclusion
cs: Vyloučení
de: Ausschluss

source: VIOLATION at
cs: PORUŠENÍ PRAVIDEL v
de: REGELVERLETZUNG in
fr: VIOLATION à

source: : Reversing most recent proposal
cs: : Vzít poslední návrh zpět
de: : Letzter Vorschlag wird zurückgenommen
fr: : Inverser la proposition la plus récente

source: FOUND SOLUTION
cs: NALEZENO ŘEŠENÍ
de: LÖSUNG GEFUNDEN
fr: SOLUTION TROUVEE

source: Cannot create paint pot for colour
cs: Barevné schéma nelze vytvořit pro barvu
de: Farbschema kann nicht erzeugt werden für Farbe
fr: Ne peut céer le pot de peinture pour cette couleur

source: Default
cs: Výchozí
de: Standard
fr: Défaut

source: Up to this size
cs: Až po tuto velikost
de: Bis zu dieser Größe
fr: Jusqu'à cette taille

source: _Hidden Subsets
cs: _Skryté podmnožiny
de: _Versteckte Subsets

source: _Naked Subsets
cs: _Odkryté podmnožiny
de: _Offene Subsets

source: NxN _Fish
cs: NxN _ryba
de: NxN _Fisch
fr: NxN _Poisson

source: Sudoku Strategies
cs: Strategie Sudoku
de: Sudoku-Strategien
fr: Startégie Sudoku

source: No Colouring
cs: Žádné barvy
de: Keine Farben
fr: Pas de coloration

source: Simple Colouring
cs: Jednoduché barvy
de: Einfache Farbe
fr: Simple coloration

source: Multi-Colouring
cs: Více barev
de: Mehrere Farben
fr: Multi coloration

source: _XY-Wings
cs: _XY-křídla
de: _XY-Schwingen

source: XY_Z-Wings
cs: XY_Z-křídla
de: XY_Z-Schwingen

source: Square
cs: poli
de: Feld
fr: Carré

source: Setting
cs: Nastavení
de: Setzen von
fr: Préférences

source: would violate the board
cs: by učinilo řešení nemožným
de: würde Lösung unmöglich machen
fr: cela violerait le tableau

source: Forbidding
cs: Zakázáno
de: Verboten
fr: Interdire

source: to be
cs: na
de: auf
fr: être

source: violates the board
cs: dělá řešení nemožným
de: macht Lösung unmöglich
fr: viole le tableau

source: Too many numbers!
cs: Příliš mnoho čísel!
de: Zu viele Zahlen!
fr: Trop de nombres!

source: _File
cs: _Soubor
de: _Datei
fr: _Fichier

source: _Save Play
cs: _Uložit hru
de: _Spiel speichern
fr: _Sauver le jeu

source: Save Play _As
cs: Uložit hru _jako
de: Spiel speichern _unter
fr: Sauver le jeu _Sous

source: Save _Puzzle
cs: Uložit _hlavolam
de: _Puzzle speichern
fr: Sauver le Sudoku Savant

source: _Options
cs: _Volby
de: _Optionen

source: _Geometry
cs: Hrací _pole
de: _Geometrie
fr: _Géométrie

source: _View
cs: _Pohled
de: _Ansicht
fr: _Voir

source: Show _Logs
cs: Ukázat _záznamy
de: Protoko_lle anzeigen
fr: Montrer _Le journal

source: Show the hint and solution logs.
cs: Ukázat záznamy rad a řešení.
de: Protokolle der Hinweise und Lösungen anzeigen.
fr: Afficher les indices et le journal des solutions.

source: _Highlight Wrong Moves
cs: _Zvýraznit chybné postupy
de: Fehlerhafte Eintragungen _hervorheben
fr: _Mettre en lumière les faux mouvements

source: Highlight any cells where the number is incorrect.
cs: Zvýraznit všechny buňky s nesprávnými čísly.
de: Alle Zellen mit falschen Einträgen hervorheben.
fr: Mettre en lunière tous les cellules contenant un faux nombre.

source: _Help
cs: _Nápověda
de: _Hilfe
fr: _Aide

source: _About
cs: _O programu
de: _Info
fr: _A propos

source: Hints
cs: Rady
de: Hinweise
fr: Indices

source: _Reveal
cs: _Odkrýt
de: _Zeigen
fr: _Révéler

source: Hi_de
cs: _Skrýt
de: _Verbergen
fr: _Cacher

source: Show _All
cs: Ukázat _vše
de: _Alle zeigen
fr: Montrer _Tout

source: Hid_e All
cs: Skrýt v_še
de: Alle v_erbergen
fr: Cacher _Tout

source: Computer's Solution
cs: Vyřešení počítačem
de: Lösung des Rechners
fr: Solution de l'ordinnateur

source: <b>Unknown</b>
cs: <b>Neznámá obtížnost</b>
de: <b>Unbekannt</b>
fr: <b>Inconnu</b>

source: A_uto
cs: A_utomaticky
de: A_utomatisch

source: _Check
cs: _Ověřit
de: _Prüfen
fr: _Vérifier

source: Generate
cs: Vytvořit
de: Erzeugen
fr: Générer

source: Solve
cs: Vyřešit
de: Lösen
fr: Résoudre

source: Geometry
cs: Hrací pole
de: Spielfeld
fr: Géométrie

source: <b>Width x Height</b>
cs: <b>Šířka x výška</b>
de: <b>Breite x Höhe</b>
fr: <b>Largeur x Hauteur</b>

source: About Sudoku Savant
cs: O hře Sudoku Savant
de: Info zu Sudoku Savant
fr: A propos de Sudoku Savant

source: Couldn't find pixmap file: %s
cs: Nepodařilo se najít soubor s pixmapou: %s
de: Pixmap-Datei %s konnte nicht gefunden werden
fr: Ne peut trouver le fichier: %s
